{
  "irmn3": {
      "zh-cn": {
        "name": "钢铁侠是一款全新跑酷类型游戏",
        "des": "然而不同于以往的跑酷游戏融入了任务升级以及装备打造等系统，这也使得这款跑酷游戏充满了更多的乐趣。"
      },
      "en-us": {
        "name": "",
        "des": "Iron Man is a brand new parkour game which is different from the traditional games because it integrated missions and pursuit equipment system to bring you more thrilling gaming experience."
      },
      "ko-kr": {
        "name": "",
        "des": "아이언맨은 통합된 임무 및 추적 장비 시스템으로 스릴 넘치는 게임 경험을 제공할 기존의 게임과는 다른 새로운 게임이다."
      },
      "th-th": {
        "name": "",
        "des": "ไอร่อนแมน เป็นเกมวิบากรูปแบบใหม่ที่แตกต่างจากเกมในรูปแบบเก่าที่เพิ่มมิชชั่นและระบบเครื่องมือที่จะทำให้ท่านได้รับประสบการณ์เกมเดิมพันที่สุดตื่นเต้นเพิ่มมากขึ้น"
      },
      "vi-vn": {
        "name": "",
        "des": "Trò chơi Iron Man mới hoàn toàn khác biệt với phiên bản cũ gồm nhiều tính năng và nhiệm vụ hơn sẽ mang lại cho bạn trải nghiệm thú vị hơn bao giờ hết."
      }
  },
  "xc_atlantisdiveslots": {
      "zh-cn": {
        "name": "亚特兰蒂斯",
        "des": "散布图案能给您带来最多 20 个自由转，而 Wild 图案能代替游戏中几乎所有图案并有助于完成赢钱组合。"
      },
      "en-us": {
        "name": "",
        "des": "Atlantis is an creative underwater theme game which bring you maximum of spinning the reels and the Wild image can replace any image of the games to obtain winning symbol combinations."
      },
      "ko-kr": {
        "name": "",
        "des": "아틀란티스는 최대 스핀 릴과 어떠한 이미지로도 대체될 수 있는 와일드카드로 우승 기호 조합을 극대화할 수 있는 창의적인 수중 테마 게임입니다."
      },
      "th-th": {
        "name": "",
        "des": "แอตแลนติสเป็นเกมที่มีธีมเกี่ยวกับเมืองใต้น้ำที่มีรอบหมุนมากที่สุด และรูปภาพWild ที่สามารถแทนรูปภาพใดๆก็ได้เพื่อทำให้รวมเป็นแถวรูปภาพที่ทำให้ท่านชนะง่ายมากขึ้น"
      },
      "vi-vn": {
        "name": "",
        "des": "Atlantis Dive là trò chơi gồm 5 cuộn xoay và 20 lines thắng cược với các biểu tượng Scatter và Wild sẽ giúp bạn giành chiến thắng Jackpot dễ dàng hơn bao giờ hết."
      }
  },
  "xc_teddyscratch": {
      "zh-cn": {
        "name": "泰迪应该就躲在这里！",
        "des": "可爱淘气的泰迪头偷偷躲起来了~快动动你的滑鼠让泰迪现形吧。"
      },
      "en-us": {
        "name": "Teddy should hide here!",
        "des": "Adorable and naughty Teddy sneaked around. Using your mouse to reveal his true features!"
      },
      "ko-kr": {
        "name": "",
        "des": "테디는 숨어야만 산다! 사랑스러움과 사악함이 공존하는 테디, 그의 본성을 드러내기 위해 당신의 마우스를 사용하세요!"
      },
      "th-th": {
        "name": "",
        "des": "หมีซ่อนอยู่ที่นี่!หมีที่น่ารักซุกซนแอบซ่อนอยู่แถวๆนี้ ใช้เมาส์คลิกเพื่อหารูปเจ้าหมี!"
      },
      "vi-vn": {
        "name": "",
        "des": "Teddy Scratch là trò chơi về chú gấu nổi tiếng với phần thưởng Jackpot xuất hiện trong 3 món quà từ Teddy trong mỗi game."
      }
  },
  "avng": {
      "zh-cn": {
        "name": "复仇者是一个奇迹角子机游戏",
        "des": "它有5个卷轴和20线，每条线，并涵盖所有的奇迹超级英雄如钢铁侠，绿巨人，美国队长和雷神。"
      },
      "en-us": {
        "name": "",
        "des": "The Avengers is a slots game which is 5-reel 20-line slots included all super heroes such as Iron Men, Hulk, Captain American and Thor."
      },
      "ko-kr": {
        "name": "",
        "des": "어벤져스는 아이언맨, 헐크, 캡틴아메리카, 토르 등 모든 슈퍼 히어로가 등장하며 5개의 릴과 20개의 라인을 가진 슬롯게임이다."
      },
      "th-th": {
        "name": "",
        "des": "ดิ อเวนเจอร์ส เป็นเกมสล็อตที่มี 5 รีล 20ไลน์ ประกอบไปด้วยบรรดาเหล่าซุปเปอร์ฮีโร่ ได้แก่ ไอร่อนแมน ฮัลค์ กัปตันอเมริกา และธอร์"
      },
      "vi-vn": {
        "name": "",
        "des": "Biệt đội siêu anh hùng The Avengers sẽ giúp bạn dễ dàng giành được phần thưởng jackpot với 20 lines thắng trong mỗi game."
      }
  },
  "spidc": {
      "zh-cn": {
        "name": "每个人都有喜欢的超级英雄吗？",
        "des": "我想，也許這取決於你的年齡。我要我的角色是個奇迹"
      },
      "en-us": {
        "name": "Does everyone love super hero?",
        "des": "I think it depends on your age. I want my role is a miracle."
      },
      "ko-kr": {
        "name": "",
        "des": "슈퍼 히어로를 사랑하나요? 그건 당신의 나이에 달려있는 질문 같군요. 기적과 같은 히어로가 되어 보세요."
      },
      "th-th": {
        "name": "",
        "des": "ทุกคนรักซุปเปอร์ฮีโร่หรือเปล่า นี่อาจจะขึ้นอยู่กับอายุของแต่ละคน ฉันอยากให้บทบาทของฉันเป็นความมหัศจรรย์"
      },
      "vi-vn": {
        "name": "",
        "des": "Bạn thích siêu nhân chứ? Điều này có thể phụ thuộc vào độ tuổi của bạn, nhưng chắc chắn một điều là ai cũng khao khát có được siêu năng lực. Vậy còn chờ gì nữa mà không tham gia ngay cùng Spider-Man giải cứu thế giới."
      }
  },
  "fcgz": {
      "zh-cn": {
        "name": "",
        "des": "在翡翠公主游戏中转动老虎机的卷轴，跟随我们探询古中国的伟大之处吧，进入秘密奖赏的游戏模式，以赚取倍数高达 100倍的赏金。"
      },
      "en-us": {
        "name": "",
        "des": "Rotation of slot machines in emerald princess game, follow us to explore the greatness of ancient China, into the secret reward game mode, to earn up to 100 times bouns."
      },
      "ko-kr": {
        "name": "",
        "des": ""
      },
      "th-th": {
        "name": "",
        "des": "เกมสล็อตเจ้าหญิงมรกตอีกหนึ่งรูปแบบที่จะทำให้ท่านได้บุกเบิกดินแดนโบราณของจีน และความลับของรางวัลและโบนัสในเกมที่สูงถึง 100 เท่า"
      },
      "vi-vn": {
        "name": "",
        "des": ""
      }
  }
}